RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_smix_regs.h
/*
 * DSTREQSEL (RW)
 *
 * Destination DMA request select. Select the request/ack handshake pair that the destination device is connected to.
 */
#define SMIX_DMA_CH_CTL_DSTREQSEL_MASK (0x3E00000UL)
#define SMIX_DMA_CH_CTL_DSTREQSEL_SHIFT (21U)
#define SMIX_DMA_CH_CTL_DSTREQSEL_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_DSTREQSEL_SHIFT) & SMIX_DMA_CH_CTL_DSTREQSEL_MASK)
#define SMIX_DMA_CH_CTL_DSTREQSEL_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_DSTREQSEL_MASK) >> SMIX_DMA_CH_CTL_DSTREQSEL_SHIFT)

/*
 * PRIORITY (RW)
 *
 * 0x0: Lower priority
 * 0x1: Higher priority
 */
#define SMIX_DMA_CH_CTL_PRIORITY_MASK (0x80000UL)
#define SMIX_DMA_CH_CTL_PRIORITY_SHIFT (19U)
#define SMIX_DMA_CH_CTL_PRIORITY_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_PRIORITY_SHIFT) & SMIX_DMA_CH_CTL_PRIORITY_MASK)
#define SMIX_DMA_CH_CTL_PRIORITY_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_PRIORITY_MASK) >> SMIX_DMA_CH_CTL_PRIORITY_SHIFT)

/*
 * SRCBURSTSIZE (RW)
 *
 * 0x0: 1 beat per transfer
 * 0x1: 2 beats per transfer
 * 0x2: 4 beats per transfer
 * 0x3: 8 beats per transfer
 * 0x4: 16 beats per transfer
 * 0x5: 32 beats per transfer
 * 0x6: 64 beats per transfer
 * 0x7: 128 beats per transfer
 */
#define SMIX_DMA_CH_CTL_SRCBURSTSIZE_MASK (0x78000UL)
#define SMIX_DMA_CH_CTL_SRCBURSTSIZE_SHIFT (15U)
#define SMIX_DMA_CH_CTL_SRCBURSTSIZE_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_SRCBURSTSIZE_SHIFT) & SMIX_DMA_CH_CTL_SRCBURSTSIZE_MASK)
#define SMIX_DMA_CH_CTL_SRCBURSTSIZE_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_SRCBURSTSIZE_MASK) >> SMIX_DMA_CH_CTL_SRCBURSTSIZE_SHIFT)

/*
 * SRCWIDTH (RW)
 *
 * Source Transfer Beat Size:
 * 0x0: Byte transfer
 * 0x1: Half-word transfer
 * 0x2: Word transfer
 */
#define SMIX_DMA_CH_CTL_SRCWIDTH_MASK (0x6000U)
#define SMIX_DMA_CH_CTL_SRCWIDTH_SHIFT (13U)
#define SMIX_DMA_CH_CTL_SRCWIDTH_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_SRCWIDTH_SHIFT) & SMIX_DMA_CH_CTL_SRCWIDTH_MASK)
#define SMIX_DMA_CH_CTL_SRCWIDTH_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_SRCWIDTH_MASK) >> SMIX_DMA_CH_CTL_SRCWIDTH_SHIFT)

/*
 * DSTWIDTH (RW)
 *
 * Destination Transfer Beat Size:
 * 0x0: Byte transfer
 * 0x1: Half-word transfer
 * 0x2: Word transfer
 */
#define SMIX_DMA_CH_CTL_DSTWIDTH_MASK (0x1800U)
#define SMIX_DMA_CH_CTL_DSTWIDTH_SHIFT (11U)
#define SMIX_DMA_CH_CTL_DSTWIDTH_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_DSTWIDTH_SHIFT) & SMIX_DMA_CH_CTL_DSTWIDTH_MASK)
#define SMIX_DMA_CH_CTL_DSTWIDTH_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_DSTWIDTH_MASK) >> SMIX_DMA_CH_CTL_DSTWIDTH_SHIFT)

/*
 * SRCMODE (RW)
 *
 * DMA Source handshake mode
 * 0x0: Normal mode
 * 0x1: Handshake mode
 */
#define SMIX_DMA_CH_CTL_SRCMODE_MASK (0x400U)
#define SMIX_DMA_CH_CTL_SRCMODE_SHIFT (10U)
#define SMIX_DMA_CH_CTL_SRCMODE_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_SRCMODE_SHIFT) & SMIX_DMA_CH_CTL_SRCMODE_MASK)
#define SMIX_DMA_CH_CTL_SRCMODE_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_SRCMODE_MASK) >> SMIX_DMA_CH_CTL_SRCMODE_SHIFT)

/*
 * DSTMODE (RW)
 *
 * DMA Destination handshake mode
 * 0x0: Normal mode
 * 0x1: Handshake mode
 */
#define SMIX_DMA_CH_CTL_DSTMODE_MASK (0x200U)
#define SMIX_DMA_CH_CTL_DSTMODE_SHIFT (9U)
#define SMIX_DMA_CH_CTL_DSTMODE_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_DSTMODE_SHIFT) & SMIX_DMA_CH_CTL_DSTMODE_MASK)
#define SMIX_DMA_CH_CTL_DSTMODE_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_DSTMODE_MASK) >> SMIX_DMA_CH_CTL_DSTMODE_SHIFT)

/*
 * SRCADDRCTRL (RW)
 *
 * 0x0: Increment address
 * 0x1: Decrement address
 * 0x2: Fixed address
 * 0x3: Reserved, setting the field with this value triggers an error exception
 */
#define SMIX_DMA_CH_CTL_SRCADDRCTRL_MASK (0x180U)
#define SMIX_DMA_CH_CTL_SRCADDRCTRL_SHIFT (7U)
#define SMIX_DMA_CH_CTL_SRCADDRCTRL_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_SRCADDRCTRL_SHIFT) & SMIX_DMA_CH_CTL_SRCADDRCTRL_MASK)
#define SMIX_DMA_CH_CTL_SRCADDRCTRL_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_SRCADDRCTRL_MASK) >> SMIX_DMA_CH_CTL_SRCADDRCTRL_SHIFT)

/*
 * DSTADDRCTRL (RW)
 *
 * 0x0: Increment address
 * 0x1: Decrement address
 * 0x2: Fixed address
 * 0x3: Reserved, setting the field with this value triggers an error exception
 */
#define SMIX_DMA_CH_CTL_DSTADDRCTRL_MASK (0x60U)
#define SMIX_DMA_CH_CTL_DSTADDRCTRL_SHIFT (5U)
#define SMIX_DMA_CH_CTL_DSTADDRCTRL_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_DSTADDRCTRL_SHIFT) & SMIX_DMA_CH_CTL_DSTADDRCTRL_MASK)
#define SMIX_DMA_CH_CTL_DSTADDRCTRL_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_DSTADDRCTRL_MASK) >> SMIX_DMA_CH_CTL_DSTADDRCTRL_SHIFT)

/*
 * ABRT_INT_EN (RW)
 *
 * Abort interrupt enable
 */
#define SMIX_DMA_CH_CTL_ABRT_INT_EN_MASK (0x8U)
#define SMIX_DMA_CH_CTL_ABRT_INT_EN_SHIFT (3U)
#define SMIX_DMA_CH_CTL_ABRT_INT_EN_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_ABRT_INT_EN_SHIFT) & SMIX_DMA_CH_CTL_ABRT_INT_EN_MASK)
#define SMIX_DMA_CH_CTL_ABRT_INT_EN_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_ABRT_INT_EN_MASK) >> SMIX_DMA_CH_CTL_ABRT_INT_EN_SHIFT)

/*
 * ERR_INT_EN (RW)
 *
 * Err interrupt enable
 */
#define SMIX_DMA_CH_CTL_ERR_INT_EN_MASK (0x4U)
#define SMIX_DMA_CH_CTL_ERR_INT_EN_SHIFT (2U)
#define SMIX_DMA_CH_CTL_ERR_INT_EN_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_ERR_INT_EN_SHIFT) & SMIX_DMA_CH_CTL_ERR_INT_EN_MASK)
#define SMIX_DMA_CH_CTL_ERR_INT_EN_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_ERR_INT_EN_MASK) >> SMIX_DMA_CH_CTL_ERR_INT_EN_SHIFT)

/*
 * TC_INT_EN (RW)
 *
 * TC interrupt enable
 */
#define SMIX_DMA_CH_CTL_TC_INT_EN_MASK (0x2U)
#define SMIX_DMA_CH_CTL_TC_INT_EN_SHIFT (1U)
#define SMIX_DMA_CH_CTL_TC_INT_EN_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_TC_INT_EN_SHIFT) & SMIX_DMA_CH_CTL_TC_INT_EN_MASK)
#define SMIX_DMA_CH_CTL_TC_INT_EN_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_TC_INT_EN_MASK) >> SMIX_DMA_CH_CTL_TC_INT_EN_SHIFT)

/*
 * EN (RW)
 *
 * channel enable bit
 */
#define SMIX_DMA_CH_CTL_EN_MASK (0x1U)
#define SMIX_DMA_CH_CTL_EN_SHIFT (0U)
#define SMIX_DMA_CH_CTL_EN_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_CTL_EN_SHIFT) & SMIX_DMA_CH_CTL_EN_MASK)
#define SMIX_DMA_CH_CTL_EN_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_CTL_EN_MASK) >> SMIX_DMA_CH_CTL_EN_SHIFT)

