RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_smix_regs.h
/* Bitfield definition for register of struct array DMA_CH: BURST_COUNT */
/*
 * NUM (RW)
 *
 * the total number of source beats
 */
#define SMIX_DMA_CH_BURST_COUNT_NUM_MASK (0xFFFFFFFFUL)
#define SMIX_DMA_CH_BURST_COUNT_NUM_SHIFT (0U)
#define SMIX_DMA_CH_BURST_COUNT_NUM_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_BURST_COUNT_NUM_SHIFT) & SMIX_DMA_CH_BURST_COUNT_NUM_MASK)
#define SMIX_DMA_CH_BURST_COUNT_NUM_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_BURST_COUNT_NUM_MASK) >> SMIX_DMA_CH_BURST_COUNT_NUM_SHIFT)

/* Bitfield definition for register of struct array DMA_CH: SRCADDR */
/*
 * PTR (RW)
 *
 * source address
 */
#define SMIX_DMA_CH_SRCADDR_PTR_MASK (0xFFFFFFFFUL)
#define SMIX_DMA_CH_SRCADDR_PTR_SHIFT (0U)
#define SMIX_DMA_CH_SRCADDR_PTR_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_SRCADDR_PTR_SHIFT) & SMIX_DMA_CH_SRCADDR_PTR_MASK)
#define SMIX_DMA_CH_SRCADDR_PTR_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_SRCADDR_PTR_MASK) >> SMIX_DMA_CH_SRCADDR_PTR_SHIFT)

/* Bitfield definition for register of struct array DMA_CH: DSTADDR */
/*
 * PTR (RW)
 *
 * destination address
 */
#define SMIX_DMA_CH_DSTADDR_PTR_MASK (0xFFFFFFFFUL)
#define SMIX_DMA_CH_DSTADDR_PTR_SHIFT (0U)
#define SMIX_DMA_CH_DSTADDR_PTR_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_DSTADDR_PTR_SHIFT) & SMIX_DMA_CH_DSTADDR_PTR_MASK)
#define SMIX_DMA_CH_DSTADDR_PTR_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_DSTADDR_PTR_MASK) >> SMIX_DMA_CH_DSTADDR_PTR_SHIFT)

/* Bitfield definition for register of struct array DMA_CH: LLP */
/*
 * PTR (RW)
 *
 * the address pointer for the linked list descriptor
 */
#define SMIX_DMA_CH_LLP_PTR_MASK (0xFFFFFFFFUL)
#define SMIX_DMA_CH_LLP_PTR_SHIFT (0U)
#define SMIX_DMA_CH_LLP_PTR_SET(x) (((uint32_t)(x) << SMIX_DMA_CH_LLP_PTR_SHIFT) & SMIX_DMA_CH_LLP_PTR_MASK)
#define SMIX_DMA_CH_LLP_PTR_GET(x) (((uint32_t)(x) & SMIX_DMA_CH_LLP_PTR_MASK) >> SMIX_DMA_CH_LLP_PTR_SHIFT)

/* Bitfield definition for register: CALSAT_ST */
/*
 * DST (W1C)
 *
 * DST CAL_SAT_ERR. W1C
 */
#define SMIX_CALSAT_ST_DST_MASK (0xC0000000UL)
#define SMIX_CALSAT_ST_DST_SHIFT (30U)
#define SMIX_CALSAT_ST_DST_SET(x) (((uint32_t)(x) << SMIX_CALSAT_ST_DST_SHIFT) & SMIX_CALSAT_ST_DST_MASK)
#define SMIX_CALSAT_ST_DST_GET(x) (((uint32_t)(x) & SMIX_CALSAT_ST_DST_MASK) >> SMIX_CALSAT_ST_DST_SHIFT)

/*
 * SRC (W1C)
 *
 * SRC CAL_SAT_ERR. W1C
 */
#define SMIX_CALSAT_ST_SRC_MASK (0x3FFFU)
#define SMIX_CALSAT_ST_SRC_SHIFT (0U)
#define SMIX_CALSAT_ST_SRC_SET(x) (((uint32_t)(x) << SMIX_CALSAT_ST_SRC_SHIFT) & SMIX_CALSAT_ST_SRC_MASK)
#define SMIX_CALSAT_ST_SRC_GET(x) (((uint32_t)(x) & SMIX_CALSAT_ST_SRC_MASK) >> SMIX_CALSAT_ST_SRC_SHIFT)

/* Bitfield definition for register: FDOT_DONE_ST */
/*
 * DST (W1C)
 *
 * DST fadeout done. W1C
 */
#define SMIX_FDOT_DONE_ST_DST_MASK (0xC0000000UL)
#define SMIX_FDOT_DONE_ST_DST_SHIFT (30U)
#define SMIX_FDOT_DONE_ST_DST_SET(x) (((uint32_t)(x) << SMIX_FDOT_DONE_ST_DST_SHIFT) & SMIX_FDOT_DONE_ST_DST_MASK)
#define SMIX_FDOT_DONE_ST_DST_GET(x) (((uint32_t)(x) & SMIX_FDOT_DONE_ST_DST_MASK) >> SMIX_FDOT_DONE_ST_DST_SHIFT)

/*
 * SRC (W1C)
 *
 * SRC fadeout done. W1C
 */
#define SMIX_FDOT_DONE_ST_SRC_MASK (0x3FFFU)
#define SMIX_FDOT_DONE_ST_SRC_SHIFT (0U)
#define SMIX_FDOT_DONE_ST_SRC_SET(x) (((uint32_t)(x) << SMIX_FDOT_DONE_ST_SRC_SHIFT) & SMIX_FDOT_DONE_ST_SRC_MASK)
#define SMIX_FDOT_DONE_ST_SRC_GET(x) (((uint32_t)(x) & SMIX_FDOT_DONE_ST_SRC_MASK) >> SMIX_FDOT_DONE_ST_SRC_SHIFT)

/* Bitfield definition for register: DATA_ST */
/*
 * DST_DA (RO)
 *
 * DST data available
 */
#define SMIX_DATA_ST_DST_DA_MASK (0xC0000000UL)
#define SMIX_DATA_ST_DST_DA_SHIFT (30U)
#define SMIX_DATA_ST_DST_DA_GET(x) (((uint32_t)(x) & SMIX_DATA_ST_DST_DA_MASK) >> SMIX_DATA_ST_DST_DA_SHIFT)

/*
 * DST_UNDL (RO)
 *
 * DST data underflow
 */
#define SMIX_DATA_ST_DST_UNDL_MASK (0x30000000UL)
#define SMIX_DATA_ST_DST_UNDL_SHIFT (28U)
#define SMIX_DATA_ST_DST_UNDL_GET(x) (((uint32_t)(x) & SMIX_DATA_ST_DST_UNDL_MASK) >> SMIX_DATA_ST_DST_UNDL_SHIFT)

/*
 * SRC_DN (RO)
 *
 * SRC data needed
 */
#define SMIX_DATA_ST_SRC_DN_MASK (0x3FFFU)
#define SMIX_DATA_ST_SRC_DN_SHIFT (0U)
#define SMIX_DATA_ST_SRC_DN_GET(x) (((uint32_t)(x) & SMIX_DATA_ST_SRC_DN_MASK) >> SMIX_DATA_ST_SRC_DN_SHIFT)

/* Bitfield definition for register of struct array DST_CH: CTRL */
/*
 * DATA_UNFL_IE (RW)
 *
 * Data Underflow Error IntEn
 */
#define SMIX_DST_CH_CTRL_DATA_UNFL_IE_MASK (0x100000UL)
#define SMIX_DST_CH_CTRL_DATA_UNFL_IE_SHIFT (20U)
#define SMIX_DST_CH_CTRL_DATA_UNFL_IE_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DATA_UNFL_IE_SHIFT) & SMIX_DST_CH_CTRL_DATA_UNFL_IE_MASK)
#define SMIX_DST_CH_CTRL_DATA_UNFL_IE_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DATA_UNFL_IE_MASK) >> SMIX_DST_CH_CTRL_DATA_UNFL_IE_SHIFT)

/*
 * THRSH (RW)
 *
 * FIFO threshold for DMA or Int. >= will generate req.  Must be greater or equal than 8. The read burst of DMA should make the fillings in the buffer be greater than 4.
 */
#define SMIX_DST_CH_CTRL_THRSH_MASK (0xFF000UL)
#define SMIX_DST_CH_CTRL_THRSH_SHIFT (12U)
#define SMIX_DST_CH_CTRL_THRSH_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_THRSH_SHIFT) & SMIX_DST_CH_CTRL_THRSH_MASK)
#define SMIX_DST_CH_CTRL_THRSH_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_THRSH_MASK) >> SMIX_DST_CH_CTRL_THRSH_SHIFT)

/*
 * CALSAT_INT_EN (RW)
 *
 * Cal Saturation IntEn
 */
#define SMIX_DST_CH_CTRL_CALSAT_INT_EN_MASK (0x800U)
#define SMIX_DST_CH_CTRL_CALSAT_INT_EN_SHIFT (11U)
#define SMIX_DST_CH_CTRL_CALSAT_INT_EN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_CALSAT_INT_EN_SHIFT) & SMIX_DST_CH_CTRL_CALSAT_INT_EN_MASK)
#define SMIX_DST_CH_CTRL_CALSAT_INT_EN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_CALSAT_INT_EN_MASK) >> SMIX_DST_CH_CTRL_CALSAT_INT_EN_SHIFT)

/*
 * DA_INT_EN (RW)
 *
 * Data Available IntEn
 */
#define SMIX_DST_CH_CTRL_DA_INT_EN_MASK (0x400U)
#define SMIX_DST_CH_CTRL_DA_INT_EN_SHIFT (10U)
#define SMIX_DST_CH_CTRL_DA_INT_EN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DA_INT_EN_SHIFT) & SMIX_DST_CH_CTRL_DA_INT_EN_MASK)
#define SMIX_DST_CH_CTRL_DA_INT_EN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DA_INT_EN_MASK) >> SMIX_DST_CH_CTRL_DA_INT_EN_SHIFT)

