RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_smix_regs.h
/*
 * ADEACTFADEOUT_EN (RW)
 *
 * AutoDeactAfterFadeOut_En:
 * Asserted to enter de-activated mode after fade-out done
 */
#define SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_MASK (0x200U)
#define SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_SHIFT (9U)
#define SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_SHIFT) & SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_MASK)
#define SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_MASK) >> SMIX_DST_CH_CTRL_ADEACTFADEOUT_EN_SHIFT)

/*
 * FADEOUT_DONE_IE (RW)
 *
 * Fade-Out interrupt enable
 */
#define SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_MASK (0x100U)
#define SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_SHIFT (8U)
#define SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_SHIFT) & SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_MASK)
#define SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_MASK) >> SMIX_DST_CH_CTRL_FADEOUT_DONE_IE_SHIFT)

/*
 * DST_DEACT (RW)
 *
 * de-activate the destination channel
 */
#define SMIX_DST_CH_CTRL_DST_DEACT_MASK (0x80U)
#define SMIX_DST_CH_CTRL_DST_DEACT_SHIFT (7U)
#define SMIX_DST_CH_CTRL_DST_DEACT_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DST_DEACT_SHIFT) & SMIX_DST_CH_CTRL_DST_DEACT_MASK)
#define SMIX_DST_CH_CTRL_DST_DEACT_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DST_DEACT_MASK) >> SMIX_DST_CH_CTRL_DST_DEACT_SHIFT)

/*
 * DST_ACT (RW)
 *
 * activate the destination channel
 */
#define SMIX_DST_CH_CTRL_DST_ACT_MASK (0x40U)
#define SMIX_DST_CH_CTRL_DST_ACT_SHIFT (6U)
#define SMIX_DST_CH_CTRL_DST_ACT_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DST_ACT_SHIFT) & SMIX_DST_CH_CTRL_DST_ACT_MASK)
#define SMIX_DST_CH_CTRL_DST_ACT_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DST_ACT_MASK) >> SMIX_DST_CH_CTRL_DST_ACT_SHIFT)

/*
 * DSTFADOUT_MEN (RW)
 *
 * Manual FadeOut_Ctrl for destionation. Auto clear.
 */
#define SMIX_DST_CH_CTRL_DSTFADOUT_MEN_MASK (0x20U)
#define SMIX_DST_CH_CTRL_DSTFADOUT_MEN_SHIFT (5U)
#define SMIX_DST_CH_CTRL_DSTFADOUT_MEN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DSTFADOUT_MEN_SHIFT) & SMIX_DST_CH_CTRL_DSTFADOUT_MEN_MASK)
#define SMIX_DST_CH_CTRL_DSTFADOUT_MEN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DSTFADOUT_MEN_MASK) >> SMIX_DST_CH_CTRL_DSTFADOUT_MEN_SHIFT)

/*
 * DSTFADOUT_AEN (RW)
 *
 * Automatically FadeOut_Ctrl for destionation. Only effective after DST_AFADEOUT is assigned a non-zero value
 */
#define SMIX_DST_CH_CTRL_DSTFADOUT_AEN_MASK (0x10U)
#define SMIX_DST_CH_CTRL_DSTFADOUT_AEN_SHIFT (4U)
#define SMIX_DST_CH_CTRL_DSTFADOUT_AEN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DSTFADOUT_AEN_SHIFT) & SMIX_DST_CH_CTRL_DSTFADOUT_AEN_MASK)
#define SMIX_DST_CH_CTRL_DSTFADOUT_AEN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DSTFADOUT_AEN_MASK) >> SMIX_DST_CH_CTRL_DSTFADOUT_AEN_SHIFT)

/*
 * DSTFADIN_EN (RW)
 *
 * FadeIn_Ctrl for destionation. Auto clear.
 */
#define SMIX_DST_CH_CTRL_DSTFADIN_EN_MASK (0x8U)
#define SMIX_DST_CH_CTRL_DSTFADIN_EN_SHIFT (3U)
#define SMIX_DST_CH_CTRL_DSTFADIN_EN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DSTFADIN_EN_SHIFT) & SMIX_DST_CH_CTRL_DSTFADIN_EN_MASK)
#define SMIX_DST_CH_CTRL_DSTFADIN_EN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DSTFADIN_EN_MASK) >> SMIX_DST_CH_CTRL_DSTFADIN_EN_SHIFT)

/*
 * DST_EN (RW)
 *
 * Dst enabled. When disabled, clear the FIFO pointers.
 */
#define SMIX_DST_CH_CTRL_DST_EN_MASK (0x4U)
#define SMIX_DST_CH_CTRL_DST_EN_SHIFT (2U)
#define SMIX_DST_CH_CTRL_DST_EN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_DST_EN_SHIFT) & SMIX_DST_CH_CTRL_DST_EN_MASK)
#define SMIX_DST_CH_CTRL_DST_EN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_DST_EN_MASK) >> SMIX_DST_CH_CTRL_DST_EN_SHIFT)

/*
 * SOFTRST (RW)
 *
 * Soft reset
 */
#define SMIX_DST_CH_CTRL_SOFTRST_MASK (0x2U)
#define SMIX_DST_CH_CTRL_SOFTRST_SHIFT (1U)
#define SMIX_DST_CH_CTRL_SOFTRST_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_SOFTRST_SHIFT) & SMIX_DST_CH_CTRL_SOFTRST_MASK)
#define SMIX_DST_CH_CTRL_SOFTRST_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_SOFTRST_MASK) >> SMIX_DST_CH_CTRL_SOFTRST_SHIFT)

/*
 * MIXER_EN (RW)
 *
 * mixer function enable.
 */
#define SMIX_DST_CH_CTRL_MIXER_EN_MASK (0x1U)
#define SMIX_DST_CH_CTRL_MIXER_EN_SHIFT (0U)
#define SMIX_DST_CH_CTRL_MIXER_EN_SET(x) (((uint32_t)(x) << SMIX_DST_CH_CTRL_MIXER_EN_SHIFT) & SMIX_DST_CH_CTRL_MIXER_EN_MASK)
#define SMIX_DST_CH_CTRL_MIXER_EN_GET(x) (((uint32_t)(x) & SMIX_DST_CH_CTRL_MIXER_EN_MASK) >> SMIX_DST_CH_CTRL_MIXER_EN_SHIFT)

/* Bitfield definition for register of struct array DST_CH: GAIN */
/*
 * VAL (RW)
 *
 * Unsigned Int, with 12 fractional bits. . The top 3 bits are for shift. Same as SHFT_CTR[2:0]
 */
#define SMIX_DST_CH_GAIN_VAL_MASK (0x7FFFU)
#define SMIX_DST_CH_GAIN_VAL_SHIFT (0U)
#define SMIX_DST_CH_GAIN_VAL_SET(x) (((uint32_t)(x) << SMIX_DST_CH_GAIN_VAL_SHIFT) & SMIX_DST_CH_GAIN_VAL_MASK)
#define SMIX_DST_CH_GAIN_VAL_GET(x) (((uint32_t)(x) & SMIX_DST_CH_GAIN_VAL_MASK) >> SMIX_DST_CH_GAIN_VAL_SHIFT)

/* Bitfield definition for register of struct array DST_CH: BUFSIZE */
/*
 * MAX_IDX (RW)
 *
 * The total length of the dst stream -1. If zero, means there is no  end of the stream.
 */
#define SMIX_DST_CH_BUFSIZE_MAX_IDX_MASK (0xFFFFFFFFUL)
#define SMIX_DST_CH_BUFSIZE_MAX_IDX_SHIFT (0U)
#define SMIX_DST_CH_BUFSIZE_MAX_IDX_SET(x) (((uint32_t)(x) << SMIX_DST_CH_BUFSIZE_MAX_IDX_SHIFT) & SMIX_DST_CH_BUFSIZE_MAX_IDX_MASK)
#define SMIX_DST_CH_BUFSIZE_MAX_IDX_GET(x) (((uint32_t)(x) & SMIX_DST_CH_BUFSIZE_MAX_IDX_MASK) >> SMIX_DST_CH_BUFSIZE_MAX_IDX_SHIFT)

/* Bitfield definition for register of struct array DST_CH: FADEIN */
/*
 * DELTA (RW)
 *
 * Fade-in delta for linear fading in from 0 to 1 (about at most 20s for 48kHz sampled sound)
 * (Using only top 14 bits for mul)
 */
#define SMIX_DST_CH_FADEIN_DELTA_MASK (0xFFFFFUL)
#define SMIX_DST_CH_FADEIN_DELTA_SHIFT (0U)
#define SMIX_DST_CH_FADEIN_DELTA_SET(x) (((uint32_t)(x) << SMIX_DST_CH_FADEIN_DELTA_SHIFT) & SMIX_DST_CH_FADEIN_DELTA_MASK)
#define SMIX_DST_CH_FADEIN_DELTA_GET(x) (((uint32_t)(x) & SMIX_DST_CH_FADEIN_DELTA_MASK) >> SMIX_DST_CH_FADEIN_DELTA_SHIFT)

/* Bitfield definition for register of struct array DST_CH: FADEOUT */
/*
 * DELTA (RW)
 *
 * Fade out in 2^DELTA samples. Now DELTA can be at most 14。
 */
#define SMIX_DST_CH_FADEOUT_DELTA_MASK (0xFFFFFUL)
#define SMIX_DST_CH_FADEOUT_DELTA_SHIFT (0U)
#define SMIX_DST_CH_FADEOUT_DELTA_SET(x) (((uint32_t)(x) << SMIX_DST_CH_FADEOUT_DELTA_SHIFT) & SMIX_DST_CH_FADEOUT_DELTA_MASK)
#define SMIX_DST_CH_FADEOUT_DELTA_GET(x) (((uint32_t)(x) & SMIX_DST_CH_FADEOUT_DELTA_MASK) >> SMIX_DST_CH_FADEOUT_DELTA_SHIFT)

/* Bitfield definition for register of struct array DST_CH: ST */
/*
 * FIFO_FILLINGS (RO)
 *
 * destination channel output FIFO fillings
 */
#define SMIX_DST_CH_ST_FIFO_FILLINGS_MASK (0x7FC0U)
#define SMIX_DST_CH_ST_FIFO_FILLINGS_SHIFT (6U)
#define SMIX_DST_CH_ST_FIFO_FILLINGS_GET(x) (((uint32_t)(x) & SMIX_DST_CH_ST_FIFO_FILLINGS_MASK) >> SMIX_DST_CH_ST_FIFO_FILLINGS_SHIFT)

