RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_smix_regs.h
/*
 * FDOUT_DONE (RO)
 *
 * Fade-Out Done. W1C
 */
#define SMIX_DST_CH_ST_FDOUT_DONE_MASK (0x20U)
#define SMIX_DST_CH_ST_FDOUT_DONE_SHIFT (5U)
#define SMIX_DST_CH_ST_FDOUT_DONE_GET(x) (((uint32_t)(x) & SMIX_DST_CH_ST_FDOUT_DONE_MASK) >> SMIX_DST_CH_ST_FDOUT_DONE_SHIFT)

/*
 * CALSAT (RO)
 *
 * Saturate Error Found. W1C
 */
#define SMIX_DST_CH_ST_CALSAT_MASK (0x10U)
#define SMIX_DST_CH_ST_CALSAT_SHIFT (4U)
#define SMIX_DST_CH_ST_CALSAT_GET(x) (((uint32_t)(x) & SMIX_DST_CH_ST_CALSAT_MASK) >> SMIX_DST_CH_ST_CALSAT_SHIFT)

/*
 * DA (RO)
 *
 * Data Available
 */
#define SMIX_DST_CH_ST_DA_MASK (0x8U)
#define SMIX_DST_CH_ST_DA_SHIFT (3U)
#define SMIX_DST_CH_ST_DA_GET(x) (((uint32_t)(x) & SMIX_DST_CH_ST_DA_MASK) >> SMIX_DST_CH_ST_DA_SHIFT)

/*
 * MODE (RO)
 *
 * The modes are:
 * Mode 0: Disabled: after reset. Program the registers, and DSTn_CTRL [DST_EN] to enter Mode 1.
 * Mode 1: Enabled and not-activated. wait for DSTn_CTRL [DSTFADIN_EN] or DSTn_CTRL [DST_ACT], jump to Mode 3 or Mode 4 based on whether Fade-in enabled.
 * Mode 3: Enabled and activated and fade-in in progress: Can not be fade out. Will send data to DMA. Jump to Mode 4 after fadin op done.
 * Mode 4: Enabled and activated and done fade-in, no fade-out yet: Can be fade out. Will send data to DMA.
 * Mode 5: Enabled and activated and fade-out in progress: After faded out OP. Will send data to DMA. Will transfer to mode 6 or mode 7 depending on the DSTn_CTRL [ADeactFadeOut_En] cfg
 * Mode 6: Enabled and activated and faded-out: faded out is done. Will send data to DMA. Will transfer to mode 7 if manual deactivated.
 * Mode 7: Enabled and De-activated: If configured to enter this mode, after auto or manuallly fade-out, or after manual de-activated. Won't send data to DMA. Won't gen data avail signals. Intf register can be programmed. Will change to Mode 3 or Mode 4  after manual ACT or Fade-in CMD. Will transfer to Mode 0 if DSTn_CTRL [DST_EN] is assigned 0. To support a new stream or, to continue the old stream after a pause.
 */
#define SMIX_DST_CH_ST_MODE_MASK (0x7U)
#define SMIX_DST_CH_ST_MODE_SHIFT (0U)
#define SMIX_DST_CH_ST_MODE_GET(x) (((uint32_t)(x) & SMIX_DST_CH_ST_MODE_MASK) >> SMIX_DST_CH_ST_MODE_SHIFT)

/* Bitfield definition for register of struct array DST_CH: DATA */
/*
 * VAL (RO)
 *
 * Output data buffer
 */
#define SMIX_DST_CH_DATA_VAL_MASK (0xFFFFFFFFUL)
#define SMIX_DST_CH_DATA_VAL_SHIFT (0U)
#define SMIX_DST_CH_DATA_VAL_GET(x) (((uint32_t)(x) & SMIX_DST_CH_DATA_VAL_MASK) >> SMIX_DST_CH_DATA_VAL_SHIFT)

/* Bitfield definition for register of struct array DST_CH: SOURCE_EN */
/*
 * VAL (RW)
 *
 * After enabled, Data needed req will be asserted. DMA can feed in data. The channel will join in the sum operation of mixer operation.
 */
#define SMIX_DST_CH_SOURCE_EN_VAL_MASK (0xFFU)
#define SMIX_DST_CH_SOURCE_EN_VAL_SHIFT (0U)
#define SMIX_DST_CH_SOURCE_EN_VAL_SET(x) (((uint32_t)(x) << SMIX_DST_CH_SOURCE_EN_VAL_SHIFT) & SMIX_DST_CH_SOURCE_EN_VAL_MASK)
#define SMIX_DST_CH_SOURCE_EN_VAL_GET(x) (((uint32_t)(x) & SMIX_DST_CH_SOURCE_EN_VAL_MASK) >> SMIX_DST_CH_SOURCE_EN_VAL_SHIFT)

/* Bitfield definition for register of struct array DST_CH: SOURCE_ACT */
/*
 * VAL (WO)
 *
 * Manually Activate the channel
 */
#define SMIX_DST_CH_SOURCE_ACT_VAL_MASK (0xFFU)
#define SMIX_DST_CH_SOURCE_ACT_VAL_SHIFT (0U)
#define SMIX_DST_CH_SOURCE_ACT_VAL_SET(x) (((uint32_t)(x) << SMIX_DST_CH_SOURCE_ACT_VAL_SHIFT) & SMIX_DST_CH_SOURCE_ACT_VAL_MASK)
#define SMIX_DST_CH_SOURCE_ACT_VAL_GET(x) (((uint32_t)(x) & SMIX_DST_CH_SOURCE_ACT_VAL_MASK) >> SMIX_DST_CH_SOURCE_ACT_VAL_SHIFT)

/* Bitfield definition for register of struct array DST_CH: SOURCE_DEACT */
/*
 * VAL (WO)
 *
 * Manually DeActivate the channel
 */
#define SMIX_DST_CH_SOURCE_DEACT_VAL_MASK (0xFFU)
#define SMIX_DST_CH_SOURCE_DEACT_VAL_SHIFT (0U)
#define SMIX_DST_CH_SOURCE_DEACT_VAL_SET(x) (((uint32_t)(x) << SMIX_DST_CH_SOURCE_DEACT_VAL_SHIFT) & SMIX_DST_CH_SOURCE_DEACT_VAL_MASK)
#define SMIX_DST_CH_SOURCE_DEACT_VAL_GET(x) (((uint32_t)(x) & SMIX_DST_CH_SOURCE_DEACT_VAL_MASK) >> SMIX_DST_CH_SOURCE_DEACT_VAL_SHIFT)

/* Bitfield definition for register of struct array DST_CH: SOURCE_FADEIN_CTRL */
/*
 * AOP (RW)
 *
 * Asserted to start fade-in operation. When the amplification factors are stable, auto clear.
 */
#define SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_MASK (0xFFU)
#define SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_SHIFT (0U)
#define SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_SET(x) (((uint32_t)(x) << SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_SHIFT) & SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_MASK)
#define SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_GET(x) (((uint32_t)(x) & SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_MASK) >> SMIX_DST_CH_SOURCE_FADEIN_CTRL_AOP_SHIFT)

/* Bitfield definition for register of struct array DST_CH: DEACT_ST */
/*
 * DST_DEACT (RO)
 *
 * Asserted when in de-active mode
 */
#define SMIX_DST_CH_DEACT_ST_DST_DEACT_MASK (0x80000000UL)
#define SMIX_DST_CH_DEACT_ST_DST_DEACT_SHIFT (31U)
#define SMIX_DST_CH_DEACT_ST_DST_DEACT_GET(x) (((uint32_t)(x) & SMIX_DST_CH_DEACT_ST_DST_DEACT_MASK) >> SMIX_DST_CH_DEACT_ST_DST_DEACT_SHIFT)

/*
 * SRC_DEACT_ST (RO)
 *
 * Asserted when in de-active mode
 */
#define SMIX_DST_CH_DEACT_ST_SRC_DEACT_ST_MASK (0xFFU)
#define SMIX_DST_CH_DEACT_ST_SRC_DEACT_ST_SHIFT (0U)
#define SMIX_DST_CH_DEACT_ST_SRC_DEACT_ST_GET(x) (((uint32_t)(x) & SMIX_DST_CH_DEACT_ST_SRC_DEACT_ST_MASK) >> SMIX_DST_CH_DEACT_ST_SRC_DEACT_ST_SHIFT)

/* Bitfield definition for register of struct array DST_CH: SOURCE_MFADEOUT_CTRL */
/*
 * OP (RW)
 *
 * Asserted to start fade-out operation. When the amplification factors are stable, auto clear.
 */
#define SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_MASK (0xFFU)
#define SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_SHIFT (0U)
#define SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_SET(x) (((uint32_t)(x) << SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_SHIFT) & SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_MASK)
#define SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_GET(x) (((uint32_t)(x) & SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_MASK) >> SMIX_DST_CH_SOURCE_MFADEOUT_CTRL_OP_SHIFT)

/* Bitfield definition for register of struct array SOURCE_CH: CTRL */
/*
 * FIFO_RESET (RW)
 *
 * Asserted to reset FIFO pointer. Cleared to exit reset state.
 */
#define SMIX_SOURCE_CH_CTRL_FIFO_RESET_MASK (0x200000UL)
#define SMIX_SOURCE_CH_CTRL_FIFO_RESET_SHIFT (21U)
#define SMIX_SOURCE_CH_CTRL_FIFO_RESET_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_FIFO_RESET_SHIFT) & SMIX_SOURCE_CH_CTRL_FIFO_RESET_MASK)
#define SMIX_SOURCE_CH_CTRL_FIFO_RESET_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_FIFO_RESET_MASK) >> SMIX_SOURCE_CH_CTRL_FIFO_RESET_SHIFT)

