RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_smix_regs.h
/*
 * THRSH (RW)
 *
 * FIFO threshold for DMA or Int. <= will generate req. Must be greater or equal than 8. This threshold is also used to trgger the internal FIR operation. To avoid the reading and writing to the same address in the memory block, the threshold should greater than 4.
 */
#define SMIX_SOURCE_CH_CTRL_THRSH_MASK (0x1FE000UL)
#define SMIX_SOURCE_CH_CTRL_THRSH_SHIFT (13U)
#define SMIX_SOURCE_CH_CTRL_THRSH_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_THRSH_SHIFT) & SMIX_SOURCE_CH_CTRL_THRSH_MASK)
#define SMIX_SOURCE_CH_CTRL_THRSH_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_THRSH_MASK) >> SMIX_SOURCE_CH_CTRL_THRSH_SHIFT)

/*
 * CALSAT_INT_EN (RW)
 *
 * Cal Saturation IntEn
 */
#define SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_MASK (0x1000U)
#define SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_SHIFT (12U)
#define SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_SHIFT) & SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_MASK)
#define SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_MASK) >> SMIX_SOURCE_CH_CTRL_CALSAT_INT_EN_SHIFT)

/*
 * DN_INT_EN (RW)
 *
 * Data Needed IntEn
 */
#define SMIX_SOURCE_CH_CTRL_DN_INT_EN_MASK (0x800U)
#define SMIX_SOURCE_CH_CTRL_DN_INT_EN_SHIFT (11U)
#define SMIX_SOURCE_CH_CTRL_DN_INT_EN_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_DN_INT_EN_SHIFT) & SMIX_SOURCE_CH_CTRL_DN_INT_EN_MASK)
#define SMIX_SOURCE_CH_CTRL_DN_INT_EN_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_DN_INT_EN_MASK) >> SMIX_SOURCE_CH_CTRL_DN_INT_EN_SHIFT)

/*
 * SHFT_CTRL (RW)
 *
 * Shift operation after FIR
 * 0: no shift (when no upsampling or up-sampling-by-2 or up-sampling-by-3)
 * 1: left-shift-by-1 (when up-sampling-by-4 or up-sampling-by-6)
 * 2: left-shift-by-1 (when up-sampling-by-8 or up-sampling-by-12)
 * 7: /2  (when rate /2)
 * Other n: shift-left-by-n, but not suggested to be used.
 */
#define SMIX_SOURCE_CH_CTRL_SHFT_CTRL_MASK (0x700U)
#define SMIX_SOURCE_CH_CTRL_SHFT_CTRL_SHIFT (8U)
#define SMIX_SOURCE_CH_CTRL_SHFT_CTRL_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_SHFT_CTRL_SHIFT) & SMIX_SOURCE_CH_CTRL_SHFT_CTRL_MASK)
#define SMIX_SOURCE_CH_CTRL_SHFT_CTRL_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_SHFT_CTRL_MASK) >> SMIX_SOURCE_CH_CTRL_SHFT_CTRL_SHIFT)

/*
 * AUTODEACTAFTERFADEOUT_EN (RW)
 *
 * Asserted to enter de-activated mode after fade-out done
 */
#define SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_MASK (0x80U)
#define SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_SHIFT (7U)
#define SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_SHIFT) & SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_MASK)
#define SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_MASK) >> SMIX_SOURCE_CH_CTRL_AUTODEACTAFTERFADEOUT_EN_SHIFT)

/*
 * FADEOUT_DONE_IE (RW)
 *
 * Fade-Out interrupt enable
 */
#define SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_MASK (0x40U)
#define SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_SHIFT (6U)
#define SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_SHIFT) & SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_MASK)
#define SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_MASK) >> SMIX_SOURCE_CH_CTRL_FADEOUT_DONE_IE_SHIFT)

/*
 * RATECONV (RW)
 *
 * 0: no rate conversion
 * 1: up-conversion x2
 * 2: up-conversion x3
 * 3: up-conversion x4
 * 4: up-conversion x6
 * 5: up-conversion x8
 * 6: up-conversion x12
 * 7: down-conversion /2
 */
#define SMIX_SOURCE_CH_CTRL_RATECONV_MASK (0x7U)
#define SMIX_SOURCE_CH_CTRL_RATECONV_SHIFT (0U)
#define SMIX_SOURCE_CH_CTRL_RATECONV_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_CTRL_RATECONV_SHIFT) & SMIX_SOURCE_CH_CTRL_RATECONV_MASK)
#define SMIX_SOURCE_CH_CTRL_RATECONV_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_CTRL_RATECONV_MASK) >> SMIX_SOURCE_CH_CTRL_RATECONV_SHIFT)

/* Bitfield definition for register of struct array SOURCE_CH: GAIN */
/*
 * VAL (RW)
 *
 * Unsigned Int, with 12 fractional bits. The top 3 bits are for shift. Same as SHFT_CTR[2:0].
 */
#define SMIX_SOURCE_CH_GAIN_VAL_MASK (0x7FFFU)
#define SMIX_SOURCE_CH_GAIN_VAL_SHIFT (0U)
#define SMIX_SOURCE_CH_GAIN_VAL_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_GAIN_VAL_SHIFT) & SMIX_SOURCE_CH_GAIN_VAL_MASK)
#define SMIX_SOURCE_CH_GAIN_VAL_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_GAIN_VAL_MASK) >> SMIX_SOURCE_CH_GAIN_VAL_SHIFT)

/* Bitfield definition for register of struct array SOURCE_CH: FADEIN */
/*
 * DELTA (RW)
 *
 * Fade -in confg.
 */
#define SMIX_SOURCE_CH_FADEIN_DELTA_MASK (0xFFFFFUL)
#define SMIX_SOURCE_CH_FADEIN_DELTA_SHIFT (0U)
#define SMIX_SOURCE_CH_FADEIN_DELTA_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_FADEIN_DELTA_SHIFT) & SMIX_SOURCE_CH_FADEIN_DELTA_MASK)
#define SMIX_SOURCE_CH_FADEIN_DELTA_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_FADEIN_DELTA_MASK) >> SMIX_SOURCE_CH_FADEIN_DELTA_SHIFT)

/* Bitfield definition for register of struct array SOURCE_CH: FADEOUT */
/*
 * DELTA (RW)
 *
 * Fade out in 2^DELTA samples. Now DELTA can be at most 14。
 */
#define SMIX_SOURCE_CH_FADEOUT_DELTA_MASK (0xFFFFFUL)
#define SMIX_SOURCE_CH_FADEOUT_DELTA_SHIFT (0U)
#define SMIX_SOURCE_CH_FADEOUT_DELTA_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_FADEOUT_DELTA_SHIFT) & SMIX_SOURCE_CH_FADEOUT_DELTA_MASK)
#define SMIX_SOURCE_CH_FADEOUT_DELTA_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_FADEOUT_DELTA_MASK) >> SMIX_SOURCE_CH_FADEOUT_DELTA_SHIFT)

/* Bitfield definition for register of struct array SOURCE_CH: BUFSIZE */
/*
 * MAXIDX (RW)
 *
 * unit as 16-bits per sample. Zero means no length limit. = Act Len-1.
 * The actual length is the up_rate*(input_data_length-4).
 * If the filter processing is down-sampling, the value of up_rate above is 1.
 * If the filter processing is up-sampling, the value of up_rate above is the up-sampling rate.
 */
#define SMIX_SOURCE_CH_BUFSIZE_MAXIDX_MASK (0xFFFFFFFFUL)
#define SMIX_SOURCE_CH_BUFSIZE_MAXIDX_SHIFT (0U)
#define SMIX_SOURCE_CH_BUFSIZE_MAXIDX_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_BUFSIZE_MAXIDX_SHIFT) & SMIX_SOURCE_CH_BUFSIZE_MAXIDX_MASK)
#define SMIX_SOURCE_CH_BUFSIZE_MAXIDX_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_BUFSIZE_MAXIDX_MASK) >> SMIX_SOURCE_CH_BUFSIZE_MAXIDX_SHIFT)

