RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_smix_regs.h
/* Bitfield definition for register of struct array SOURCE_CH: ST */
/*
 * FIFO_FILLINGS (RO)
 *
 * The fillings of input FIFO.
 */
#define SMIX_SOURCE_CH_ST_FIFO_FILLINGS_MASK (0x7FC00UL)
#define SMIX_SOURCE_CH_ST_FIFO_FILLINGS_SHIFT (10U)
#define SMIX_SOURCE_CH_ST_FIFO_FILLINGS_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_ST_FIFO_FILLINGS_MASK) >> SMIX_SOURCE_CH_ST_FIFO_FILLINGS_SHIFT)

/*
 * FDOUT_DONE (W1C)
 *
 * Fade-Out Done. W1C
 */
#define SMIX_SOURCE_CH_ST_FDOUT_DONE_MASK (0x200U)
#define SMIX_SOURCE_CH_ST_FDOUT_DONE_SHIFT (9U)
#define SMIX_SOURCE_CH_ST_FDOUT_DONE_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_ST_FDOUT_DONE_SHIFT) & SMIX_SOURCE_CH_ST_FDOUT_DONE_MASK)
#define SMIX_SOURCE_CH_ST_FDOUT_DONE_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_ST_FDOUT_DONE_MASK) >> SMIX_SOURCE_CH_ST_FDOUT_DONE_SHIFT)

/*
 * CALSAT (W1C)
 *
 * Calculation saturation status. W1C
 */
#define SMIX_SOURCE_CH_ST_CALSAT_MASK (0x100U)
#define SMIX_SOURCE_CH_ST_CALSAT_SHIFT (8U)
#define SMIX_SOURCE_CH_ST_CALSAT_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_ST_CALSAT_SHIFT) & SMIX_SOURCE_CH_ST_CALSAT_MASK)
#define SMIX_SOURCE_CH_ST_CALSAT_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_ST_CALSAT_MASK) >> SMIX_SOURCE_CH_ST_CALSAT_SHIFT)

/*
 * DN (RO)
 *
 * Data needed flag
 */
#define SMIX_SOURCE_CH_ST_DN_MASK (0x80U)
#define SMIX_SOURCE_CH_ST_DN_SHIFT (7U)
#define SMIX_SOURCE_CH_ST_DN_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_ST_DN_MASK) >> SMIX_SOURCE_CH_ST_DN_SHIFT)

/*
 * FIRPHASE (RO)
 *
 * the poly phase counter
 */
#define SMIX_SOURCE_CH_ST_FIRPHASE_MASK (0x78U)
#define SMIX_SOURCE_CH_ST_FIRPHASE_SHIFT (3U)
#define SMIX_SOURCE_CH_ST_FIRPHASE_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_ST_FIRPHASE_MASK) >> SMIX_SOURCE_CH_ST_FIRPHASE_SHIFT)

/*
 * MODE (RO)
 *
 * The modes are:
 * Mode 0: Disabled: after reset. Program the registers, and DSTx_SRC_EN[n] to enter Mode 1.
 * Mode 1: Enabled but not activated: After Enabled. Data needed signal can send out, can receive DMA data. Will enter Mode 2 after manual ACT or Fade-in CMD
 * Mode 2: Enabled and activated and buffer feed-in in progress: Can not be fade out. Will consume data from DMA. If not enter due to Fade-in CMD, will enter Mode 4, else enter Mode 3. This mode is used to make the channel in MIX only after initial data are ready, thus will not stall mix operation due to the lackness of data of this channel omly.
 * Mode 3: Enabled and activated and fade-in in progress: Can not be fade out. Will consume data from DMA.
 * Mode 4: Enabled and activated and done fade-in, no fade-out yet: Can be fade out. Will consume data from DMA.
 * Mode 5: Enabled and activated and fade-out in progress: After faded out done. Will consume data from DMA. Will transfer to mode 6 or mode 7 depending on the SRCn_CTRL[AutoDeactAfterFadeOut_En] cfg
 * Mode 6: Enabled and activated and faded-out: faded out is done. Will consume data from DMA. Will transfer to mode 7 if manual deactivated.
 * Mode 7: Enabled and De-activated: If configured to enter this mode, after auto or manuallly fade-out, or after manual de-activated. Won't consume data from DMA. Won't gen data needed signals. Intf register can be programmed. Will change to Mode 2 after manual ACT or Fade-in CMD. Will transfer to Mode 0 if DSTx_SRC_EN[n] is assigned 0. To support a new stream or, to continue the old stream after a pause.
 */
#define SMIX_SOURCE_CH_ST_MODE_MASK (0x7U)
#define SMIX_SOURCE_CH_ST_MODE_SHIFT (0U)
#define SMIX_SOURCE_CH_ST_MODE_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_ST_MODE_MASK) >> SMIX_SOURCE_CH_ST_MODE_SHIFT)

/* Bitfield definition for register of struct array SOURCE_CH: DATA */
/*
 * VAL (WO)
 *
 * Data input register
 */
#define SMIX_SOURCE_CH_DATA_VAL_MASK (0xFFFFFFFFUL)
#define SMIX_SOURCE_CH_DATA_VAL_SHIFT (0U)
#define SMIX_SOURCE_CH_DATA_VAL_SET(x) (((uint32_t)(x) << SMIX_SOURCE_CH_DATA_VAL_SHIFT) & SMIX_SOURCE_CH_DATA_VAL_MASK)
#define SMIX_SOURCE_CH_DATA_VAL_GET(x) (((uint32_t)(x) & SMIX_SOURCE_CH_DATA_VAL_MASK) >> SMIX_SOURCE_CH_DATA_VAL_SHIFT)



/* DMA_CH register group index macro definition */
#define SMIX_DMA_CH_0 (0UL)
#define SMIX_DMA_CH_1 (1UL)
#define SMIX_DMA_CH_2 (2UL)
#define SMIX_DMA_CH_3 (3UL)
#define SMIX_DMA_CH_4 (4UL)
#define SMIX_DMA_CH_5 (5UL)
#define SMIX_DMA_CH_6 (6UL)
#define SMIX_DMA_CH_7 (7UL)
#define SMIX_DMA_CH_8 (8UL)
#define SMIX_DMA_CH_9 (9UL)
#define SMIX_DMA_CH_10 (10UL)
#define SMIX_DMA_CH_11 (11UL)
#define SMIX_DMA_CH_12 (12UL)
#define SMIX_DMA_CH_13 (13UL)
#define SMIX_DMA_CH_14 (14UL)
#define SMIX_DMA_CH_15 (15UL)
#define SMIX_DMA_CH_16 (16UL)
#define SMIX_DMA_CH_17 (17UL)
#define SMIX_DMA_CH_18 (18UL)
#define SMIX_DMA_CH_19 (19UL)
#define SMIX_DMA_CH_20 (20UL)
#define SMIX_DMA_CH_21 (21UL)
#define SMIX_DMA_CH_22 (22UL)
#define SMIX_DMA_CH_23 (23UL)
#define SMIX_DMA_CH_24 (24UL)
#define SMIX_DMA_CH_25 (25UL)

/* DST_CH register group index macro definition */
#define SMIX_DST_CH_0 (0UL)
#define SMIX_DST_CH_1 (1UL)

/* SOURCE_CH register group index macro definition */
#define SMIX_SOURCE_CH_0 (0UL)
#define SMIX_SOURCE_CH_1 (1UL)
#define SMIX_SOURCE_CH_2 (2UL)
#define SMIX_SOURCE_CH_3 (3UL)
#define SMIX_SOURCE_CH_4 (4UL)
#define SMIX_SOURCE_CH_5 (5UL)
#define SMIX_SOURCE_CH_6 (6UL)
#define SMIX_SOURCE_CH_7 (7UL)
#define SMIX_SOURCE_CH_8 (8UL)
#define SMIX_SOURCE_CH_9 (9UL)
#define SMIX_SOURCE_CH_10 (10UL)
#define SMIX_SOURCE_CH_11 (11UL)
#define SMIX_SOURCE_CH_12 (12UL)
#define SMIX_SOURCE_CH_13 (13UL)


#endif /* HPM_SMIX_H */
